{
  "ale": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
  "fzf.vim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "main" },
  "open-browser-github.vim": { "branch": "master" },
  "open-browser.vim": { "branch": "master" },
  "vim-airline": { "branch": "master" },
  "vim-airline-themes": { "branch": "master" },
  "vim-esearch": { "branch": "master" },
  "vim-hybrid-material": { "branch": "master" },
  "vim-plist": { "branch": "master" },
  "vim-surround": { "branch": "master" }
}
