cask_args appdir: '/Applications'

# =========================================================
# Quicklook extensions
# =========================================================
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

# =========================================================
# Development
# =========================================================
# Utils/Build tools
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'makedepend'
brew 'pcre'
brew 'wget'

# Development tools
cask 'aws-vault'
brew 'bcrypt'
brew 'chamber'
brew 'fzf'
brew 'git'
tap 'heroku/brew'
brew 'heroku/brew/heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'neovim'
system 'pip3 install neovim'
brew 'p7zip'
brew 'ripgrep'
brew 'tig'
brew 'tree'
tap 'universal-ctags/universal-ctags'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'watchman'

# Libraries
brew 'imagemagick', args: ['with-libtiff', 'with-little-cms', 'with-ghostscript']

# Languages
brew 'go'
brew 'dep'
brew 'nodenv'
brew 'python'
brew 'rbenv'
brew 'yarn', args: ['without-node']

# Databases
brew 'mysql', restart_service: :changed
brew 'postgresql', restart_service: :changed
brew 'redis', restart_service: :changed

# Tools that require passwords
cask 'docker-toolbox'
cask 'caskroom/versions/java8'
brew 'elasticsearch', restart_service: :changed

# =========================================================
# Applications
# =========================================================
cask 'alfred'
cask 'bartender'
cask 'dash'
cask 'dashlane'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'keepingyouawake'
cask 'paw'
cask 'slack'
cask 'spotify'

mas 'DaisyDisk', id: 411643860
mas 'Fantastical 2', id: 975937182
mas 'Kindle', id: 405399194
mas 'Magnet', id: 441258766
mas 'The Archive Browser', id: 510232205
mas 'The Unarchiver', id: 425424353
