cask_args appdir: '/Applications'

# =========================================================
# Quicklook extensions
# =========================================================
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

tap 'caskroom/fonts'
cask 'font-source-code-pro'

# =========================================================
# Development
# =========================================================
# Utils/Build tools
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'makedepend'
brew 'pcre'
brew 'wget'

# Development tools
cask 'aws-vault'
brew 'bcrypt'
brew 'fzf'
brew 'git'
brew 'htop'
cask 'karabiner-elements'
brew 'neovim'
system 'pip3 install neovim'
brew 'p7zip'
brew 'ripgrep'
brew 'tree'
brew 'watchman'
brew 'gh'

# Languages
brew 'go'
brew 'nodenv'
brew 'python'
brew 'yarn', args: ['without-node']

# Tools that require passwords
cask 'docker-toolbox'
cask 'caskroom/versions/java8'

# =========================================================
# Applications
# =========================================================
cask 'alfred'
cask 'iterm2'
cask 'paw'
cask 'spotify'
cask 'elgato-wave-link'
cask 'elgato-stream-deck'
cask 'elgato-control-center'
cask 'rectangle' # replacement for spectacle

mas 'DaisyDisk', id: 411643860
mas 'Fantastical 2', id: 975937182
mas 'Kindle', id: 405399194
mas 'Magnet', id: 441258766
mas 'The Archive Browser', id: 510232205
mas 'The Unarchiver', id: 425424353
