# =========================================================
# Customization
# =========================================================
# Quicklook extensions
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

# =========================================================
# Development
# =========================================================

# Utils/Build tools
# Not sure how many of these I actually need
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'makedepend'
brew 'pcre'
brew 'wget'
brew 'xz'

# Deployment tools
cask 'aws-vault'
brew 'bcrypt'
brew 'chamber'
brew 'docker'
brew 'docker-machine'
brew 'fzf'
brew 'git'
brew 'git-crypt'
brew 'heroku/brew/heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'neovim'
system 'pip3 install neovim'
brew 'p7zip'
brew 'ripgrep'
brew 'tig'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'vim', args: ['with-lua', 'with-python3']
brew 'vimpager'
brew 'watchman'

# Libraries
brew 'imagemagick', args: ['with-libtiff', 'with-little-cms', 'with-ghostscript']

# Languages
brew 'crystal-lang'
brew 'elixir'
brew 'go'
brew 'dep'
brew 'nodenv'
brew 'python'
brew 'rbenv'
brew 'rust'
brew 'yarn', args: ['without-node']

# Databases
brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'

# Other webdev tools
brew 'elasticsearch', restart_service: true

# =========================================================
# Applications
# =========================================================
cask 'alfred'
cask 'bartender'
cask 'dash'
cask 'dashlane'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'keepingyouawake'
cask 'paw'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'transmit'
cask 'virtualbox'
cask 'vlc'

mas 'DaisyDisk', id: 411643860
mas 'Fantastical 2', id: 975937182
mas 'Kindle', id: 405399194
mas 'Magnet', id: 441258766
mas 'Music Converter Pro', id: 468990782
mas 'The Archive Browser', id: 510232205
mas 'The Unarchiver', id: 425424353
mas 'WSwitch', id: 1004094307
